In [1]:
# Pandas Introduction

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("nyc_weather.csv")

In [4]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [5]:
df.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [6]:
df.shape

(31, 11)

In [7]:
type(df.shape)

tuple

In [11]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Temperature,31.0,34.677419,7.639315,20.00,29.000,35.00,39.50,50.00
DewPoint,31.0,17.838710,11.378626,-3.00,10.000,18.00,23.00,46.00
Humidity,31.0,51.677419,11.634395,33.00,44.500,50.00,55.00,78.00
Sea Level PressureIn,31.0,29.992903,0.237237,29.52,29.855,30.01,30.14,30.57
VisibilityMiles,31.0,9.193548,1.939405,1.00,9.000,10.00,10.00,10.00
WindSpeedMPH,28.0,6.892857,2.871821,2.00,5.000,6.50,8.00,16.00
CloudCover,31.0,3.129032,2.629853,0.00,1.000,3.00,4.50,8.00
WindDirDegrees,31.0,247.129032,92.308086,34.00,238.000,281.00,300.00,345.00

In [12]:
df['Temperature'].max()

50

In [13]:
df['Temperature'].min()

20

In [14]:
df['Temperature'].mean()

34.67741935483871

In [15]:
df['EST'][df['Events'] == 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [18]:
df.EST[df.Events == 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [19]:
df[df.Events == 'Rain']

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311

In [24]:
df['EST'][(df['Events'] == 'Rain') & (df['CloudCover'] > 3)]

8      1/9/2016
9     1/10/2016
15    1/16/2016
Name: EST, dtype: object

In [25]:
# Parsing without Pandas

In [26]:
import csv

_parsed_rows = []

def parse_csv():
    _file_path = "nyc_weather.csv"

    global _parsed_rows
    with open(_file_path, "r") as f:
        reader = csv.reader(f, delimiter=',')
        next(reader)
        for row in reader:
            _parsed_rows.append({
                'date':  row[0],
                'temperature': row[1],
                'DewPoint': row[2],
                'Humidity': row[3],
                'Sea_Level_PressureIn': row[4],
                'VisibilityMiles': row[5],
                'WindSpeedMPH': row[6],
                'PrecipitationIn': row[7],
                'CloudCover': row[8],
                'Events': row[9],
                'WindDirDegrees': row[10]
            })
            
def get_max_temperature():
    max_temp = 0
    for row in _parsed_rows:
        if int(row['temperature']) > max_temp:
            max_temp = int(row['temperature'])
    return max_temp

def get_days_of_rain(event):
    days = []
    for row in _parsed_rows:
        if row['Events'] == event:
            days.append(row['date'])
    return days

def get_avg_wind_speed():
    total = 0
    count = 0
    for row in _parsed_rows:
        speed = 0 if row['WindSpeedMPH']=='' else int(row['WindSpeedMPH'])
        total += speed
        count += 1
    return float(total/count)

if __name__ == '__main__':
    parse_csv()
    
    print("Max Temperature is : " + str(get_max_temperature()))
    print("Days of rain : " + str(get_days_of_rain('Rain')))
    print("Average wind speed is : " + str(get_avg_wind_speed()))

Max Temperature is : 50
Days of rain : ['1/9/2016', '1/10/2016', '1/16/2016', '1/27/2016']
Average wind speed is : 6.225806451612903

In [27]:
# Introduction to DataFrame

In [28]:
df = pd.read_csv("weather_data.csv")
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [29]:
df.shape

(6, 4)

In [30]:
weather_data = [
    ('1/1/2017', 32, 6, 'Rain'),
    ('1/2/2017', 35, 7, 'Sunny'),
    ('1/3/2017', 28, 2, 'Snow'),
    ('1/4/2017', 24, 7, 'Snow'),
    ('1/5/2017', 32, 4, 'Rain'),
    ('1/6/2017', 31, 2, 'Sunny')
]

df = pd.DataFrame(weather_data, columns=['Day', 'Temperature', 'Windspeed', 'Event'])
df.head()

        Day  Temperature  Windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [31]:
df.shape

(6, 4)

In [32]:
df.tail()

        Day  Temperature  Windspeed  Event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [33]:
df[2:5]

        Day  Temperature  Windspeed Event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [34]:
df.columns

Index(['Day', 'Temperature', 'Windspeed', 'Event'], dtype='object')

In [35]:
df.Day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: Day, dtype: object

In [36]:
df['Day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: Day, dtype: object

In [39]:
df[['Day', 'Event']]

        Day  Event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [40]:
df['Temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: Temperature, dtype: int64

In [41]:
df.Temperature.describe()

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: Temperature, dtype: float64

In [42]:
df.describe().transpose()

             count       mean       std   min    25%   50%    75%   max
Temperature    6.0  30.333333  3.829708  24.0  28.75  31.5  32.00  35.0
Windspeed      6.0   4.666667  2.338090   2.0   2.50   5.0   6.75   7.0

In [43]:
df[df.Temperature == df.Temperature.max()]

        Day  Temperature  Windspeed  Event
1  1/2/2017           35          7  Sunny

In [45]:
df.Day[df.Temperature == df.Temperature.max()]

1    1/2/2017
Name: Day, dtype: object

In [48]:
df[['Day', 'Temperature']][df.Temperature == df.Temperature.max()]

        Day  Temperature
1  1/2/2017           35

In [49]:
# DataFrame Operations

In [50]:
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [51]:
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [52]:
df.to_csv('practice.csv')

In [53]:
df.to_csv('practice_without_index.csv', index=False)

In [57]:
df.to_excel('practice.xlsx', sheet_name='weather_data', index=False)

In [59]:
df = pd.read_csv('weather_data_cities.csv')
city_group = df.groupby('city')
city_group

In [60]:
for city, city_df in city_group:
    print(city)
    print(city_df)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [61]:
city_group.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [62]:
city_group.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [63]:
city_group.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [64]:
city_group.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [65]:
city_group.describe().transpose()

city                  mumbai   new york      paris
temperature count   4.000000   4.000000   4.000000
            mean   88.500000  32.250000  47.750000
            std     3.109126   3.304038   5.315073
            min    85.000000  28.000000  42.000000
            25%    86.500000  31.000000  44.250000
            50%    88.500000  32.500000  47.500000
            75%    90.500000  33.750000  51.000000
            max    92.000000  36.000000  54.000000
windspeed   count   4.000000   4.000000   4.000000
            mean    9.250000   8.000000  12.750000
            std     5.057997   2.708013   5.251984
            min     5.000000   6.000000   8.000000
            25%     5.000000   6.750000   9.500000
            50%     8.500000   7.000000  11.500000
            75%    12.750000   8.250000  14.750000
            max    15.000000  12.000000  20.000000

In [66]:
india_weather = pd.DataFrame({
    "City": ["Mumbai","Delhi","Banglore", "Chennai"],
    "Temperature": [32,45,30,36],
    "Humidity": [80, 60, 78, 82]
})


us_weather = pd.DataFrame({
    "City": ["New York","Chicago","Orlando"],
    "Temperature": [21,14,35],
    "Humidity": [68, 65, 75]
})

In [67]:
india_weather

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           36        82

In [68]:
us_weather

       City  Temperature  Humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [69]:
df = pd.concat([india_weather, us_weather])
df

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           36        82
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [70]:
df = pd.concat([india_weather, us_weather], ignore_index=True)

In [71]:
df

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           36        82
4  New York           21        68
5   Chicago           14        65
6   Orlando           35        75

In [73]:
df = pd.concat([india_weather, us_weather], axis=1)
df

       City  Temperature  Humidity      City  Temperature  Humidity
0    Mumbai           32        80  New York         21.0      68.0
1     Delhi           45        60   Chicago         14.0      65.0
2  Banglore           30        78   Orlando         35.0      75.0
3   Chennai           36        82       NaN          NaN       NaN

In [74]:
temperature_df = pd.DataFrame({
    "City": ["Mumbai","Delhi","Chennai", 'Hyderabad'],
    "Temperature": [32,45,36,40]})

temperature_df

        City  Temperature
0     Mumbai           32
1      Delhi           45
2    Chennai           36
3  Hyderabad           40

In [75]:
humidity_df = pd.DataFrame({
    "City": ["Delhi","Mumbai","Chennai"],
    "Humidity": [68, 65, 75]})

humidity_df

      City  Humidity
0    Delhi        68
1   Mumbai        65
2  Chennai        75

In [77]:
df = pd.merge(temperature_df, humidity_df, on='City')
df

      City  Temperature  Humidity
0   Mumbai           32        65
1    Delhi           45        68
2  Chennai           36        75

In [78]:
df = pd.merge(temperature_df, humidity_df, on='City', how='outer')
df

        City  Temperature  Humidity
0     Mumbai           32      65.0
1      Delhi           45      68.0
2    Chennai           36      75.0
3  Hyderabad           40       NaN

Notes: https://stackoverflow.com/questions/53645882/pandas-merging-101

In [80]:
# Numerical Indexing (.loc vs .iloc)

In [81]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [82]:
df.loc[46]

0    4
Name: 46, dtype: int64

In [83]:
df.iloc[46]

IndexError: single positional indexer is out-of-bounds

In [84]:
df.iloc[4]

0    5
Name: 45, dtype: int64